using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace mh.mhxy
{
    /// <summary>
    /// 指令备注
    /// </summary>
    class Remarks
    {
        //第7位开始代表种类和点数,3-6宝宝ID
        //宝宝加力量
        //BC 0A B5 93 43 21 00 00 06 00 00 00
        //宝宝加体质
        //BC 0A B5 93 43 21 01 00 00 00 00 00
        //宝宝加法力
        //BC 0A B5 93 43 21 00 01 00 00 00 00
        ////宝宝加耐力
        //BC 0A B5 93 43 21 00 00 00 01 00 00
        ////宝宝加敏捷
        //BC 0A B5 93 43 21 00 00 00 00 01 00

        //人物加点操作
        //人物加体质
        //20 06 01 00 00 00 00 00
        //人物加力量
        //20 06 00 00 01 00 00 00
        ////人物加耐力
        //20 06 00 00 00 01 00 00
        //人物加敏捷
        //20 06 00 00 00 00 01 00
        //人物加魔力
        //20 06 00 01 00 00 00 00
        //组合发送点 20点属性分配
        //20 06 08 00 00 08 04 00

        //
        //创建队伍
        //71 05 48 2C BD 01 00
        //组队申请
        //71 05 48 2C BD 01 00
        //组队申请列表
        //79 49 00 00 01 50 2C BD 01 A6 AE CB DE A6 AD C4 FD 00 00 00 00 00 00 00 00 08 00 00 00 00 01 00 0A 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 03 00
        //允许组队
        //7F 06 01 50 2C BD 01 00

    }
}
